bad_jokes = [
    '— Будешь выходить — труп вынеси!\n— Может быть, мусор?\n— Может — мусор, может — сантехник, хуй его знает…',
    "— Ура, я поступила в автошколу, скоро будет на одного пешехода меньше!\n— А может, и не на одного.",
    "Когда изобретатель USB-порта умрет, его гроб сначала опустят в яму, потом поднимут и перевернут и опустят снова\n "
    "правильной стороной.",
    "— Моя девушка порвала со мной, и я забрал ее кресло-каталку. Угадайте, кто приполз ко мне на коленях?",
    "Если бы моя бабушка знала, сколько денег я сэкономил на ее похоронах, то она бы перевернулась в канаве.",
    "Зажги человеку костер, и ему будет тепло до конца дня.\n Зажги человеку одежду на нем, и ему будет тепло до конца "
    "жизни.",
    "Акробат умер на батуте, но еще какое-то время продолжал радовать публику.",
    "Шутки про утопленников обычно несмешные, потому что лежат на поверхности.",
    "— Кот умер год назад. Так я до сих пор замедляю шаг в коридоре, там, где он любил лежать, чтобы не споткнуться\n "
    "об него в темноте.\n— Может, пора его похоронить?",
    "Фальшивого дрессировщика в цирке быстро раскусили.",
    "Задолбали соседи. Пьянки, гулянки, то поют, то дерутся.\n "
    "Решил переехать. Только надо поймать момент,\n "
    "когда они вместе дорогу переходить будут.",
    "Когда я вижу вырезанные на деревьях имена влюбленных, я не нахожу это романтичным. Кошмарно, что люди ходят на "
    "свидания с ножами.",
    "Террористы были настолько бедными, что им пришлось заложить бомбу.",
    '- Тараканы в доме есть?\n'
    '- Нет, их пауки съели.\n'
    '- У Вас пауки есть?\n'
    '- Нет, их крысы съели.\n'
    '- У Вас крысы есть?!\n'
    '- Нет, их Валентин Геннадьевич Белов съел.\n'
    '- А кто это?\n'
    '- Забыл представиться.',
    '- Свобода ворам, хуй мусорам.\n'
    '- Честно сказать, адвокат вы так себе.',
    '-Любимый, ты не видел мои купоны в солярий?\n'
    '-Я их украл и раздал бледным.',
    'Звонок в квартиру из ЖЭКа:\n'
    '— У вас унитаз работает? Хорошо... к вам сейчас трое соседей срать'
    'придут.',
    'Приходит мужик на шоу «Ищем таланты». Здоровается жестами.\n'
    'Ведущий:\n'
    '–Вы немой?\n'
    'Мужик кивает и показывает жестами.\n'
    'Ведущий:\n'
    '–А какой у вас талант?\n'
    'Мужик:\n'
    '–Я могу говорить.\n',
    'Мужчина с револьвером врывается в бар, оглядывается по сторонам и сиплым голосом выдаёт:\n'
    '— Кто из вас спал с моей женой?\n'
    'Откуда-то с дальнего столика тихо так:\n'
    '— Ты\n'
    'Так, слово за слово, мужик застрелился.',
    'Умирает Папа Римский.'
    'У ворот Рая встречает его Петр.\n'
    '- Как зовут тебя? - спрашивает Петр.\n'
    '- Я Папа Римский!\n'
    '- Папа, папа, - шепчет себе под нос Петр, - сожалею, но папы римского у меня в списке нет...\n'
    '- Но я же был заместителем Бога на земле!\n'
    '- У Бога есть заместитель на земле?! - удивленно спрашивает Петр, - Странно, я ничего об этом не знаю...\n'
    '- Я глава Католической Церкви!\n'
    '- Католическая Церковь? Никогда не слышал о такой... Подождите, я спрошу у Шефа.\n'
    '- Шеф, - спрашивает Петр у Бога, - там один чудак утверждает, что он ваш заместитель на земле, '
    'его зовут Папа Римский - вам это о чем-то говорит?\n'
    '- Нет, - отвечает Бог, - но погоди, давай спросим у Иисуса.\n'
    'Бог и Петр объясняют Иисусу ситуацию.\n'
    '- Подождите, - говорит Иисус, - я сам с ним поговорю.\n'
    'Через 10 минут Иисус, смеясь до слез, приходит назад.\n'
    '- Помните рыболовный кружок, который я организовал 2000 лет назад? Он до сих пор существует!',
    'Сидят евреи в газовой камере и к ним приходят нацисты и говорят: Кто из вас плитку класть умеет?\n'
    'Из толпы робко отозвались пара людей.\n'
    'Нацисты спросили:\n'
    '- Сколько стоит проложить метр?\n' 
    '- 5 шекелей. \n'
    '- За 3 согласны?\n'
    '- Закройте дверь пожалуйста.',
    'Вампир выходит из зеркального лабиринта и говорит:\n'
    '— В чем прикол?',
    '— Тук-тук\n'
    '— Кто там?\n'
    '— Дед\n'
    '— ОСТАНОВИТЕ ПОХОРОНЫ!!!\n',
    '- Вовочка, одевайся, мы отвезём тебя к дедушке с бабушкой. \n'
    '- Мама, я не хочу к ним ехать.\n'
    '- Вовочка, давай быстрее, а то мы опаздываем.\n'
    '- Но там такая скукотища!\n'
    '- Сынок, не капризничай, сейчас 8.00, а в 17.00 мы тебя заберём.\n'
    '- Ну, и что я буду делать 9 часов на кладбище?!',
    'Бедный студент десять раз заварил чайный пакетик, '
    'потом сделал из него марлю на форточку, скурил всю заварку, а через неделю повесился на ниточке.',
    'В дверь тихонько постучали 184 раза, три минуты гладили '
    'дерево и едва поводили ноготком.\n'
    '"АСМРщики" - подумал Штирлиц',
    'Что носят однорукие гопники?\n'
    '\n'
    'Параолимпийки',
    'Почему безногий человек не может собрать шкаф?\n'
    '\n'
    'Потому что инструкция пошаговая',
    'Заходит негр в бар. На плече у него сидит попугай. Бармен спрашивает:\n'
    '-где купил? \n'
    'Попугай отвечает:\n'
    '-на рынке\n',
    'Штирлиц гулял по лесу и увидел голубые ели. Прислушался и понял, что голубые не только ели, но и играли в доту' ]

history_jokes = [
    '- Вань, у тебя есть гранаты? Кинь мне одну, пожалуйста...',
    'Чистоплотный мужчина всегда моет '
    'сахарницу перед тем, как засыпать '
    'новый сахар, масленку перед тем, '
    'как положить свежее масло и разводится '
    'перед тем, как привести новую женщину.',
    'Японская певица Ибаца Нибаица.',
    'Каждый человек сам по себе уже единица, '
    'а по жизни ему еще добавляют нули - кому справа, '
    'кому слева.',
    'В жизни надо все попробовать все! И трезвым чуть-чуть побыть надо!!!',
    'Печень в России больше чем просто орган.',
    'Заходит игроман в кафе. Заказывает суп. Берет солонку и начинает посыпать соль, '
    'как тут откручивается крышка и вся соль высыпается в суп.\nОн расстраивается:\n- Вот, блин, '
    'надо было сохраниться!',
    '- Как сделать двойню?\n- Надо член обернуть в копировальную бумагу.',
    'В борту корабля обнаружилась протечка. Капитан боцману:\n- Эй, сколько там воды в трюме?\n- По '
    'хуй.\n- Ну ладно.\nКорабль утонул.',
    'Папуас папуасу:\n- А давай нынче куда-нибудь махнем дикарями!',
    'Солдат пишет домой из армии: Нас тут учат убирать снег и варить картошку.\n'
    'Так что если враг нападет — мы ему дорогу расчистим и жрать приготовим.',
    '— Плохо стреляете, товарищи солдаты, — недовольно говорит инспектирующий генерал.\n'
    'Сам берет автомат, прицеливается и дает очередь.\n'
    '— Ноль!\n'
    '— Вот именно так вы и стреляете. Позор! Товарищ капитан, покажите роте, как надо!',
    'Есть такая профессия — себя от Родины защищать.',
    'Теперь, после выхода цветной версии «17 мгновений весны», '
    'Штирлиц легко мог найти свой дом по красному флагу на крыше...',
    'Штирлиц, проходя по переулку заметил, как маляр закрашивал матерные слова на заборе.\n'
    '— Модератор! — подумал Штирлиц.',
    'Люди Бормана перекрыли все выходы из дома Штирлица, но пронырливый разведчик вышел через вход.',
    '— Вовочка! Почему твое домашнее задание, описание кошки, дословно совпадает с работой твоего брата?\n'
    '— А что тут объяснять? У нас дома только одна кошка.',
    '— Вовочка, скажи, если один плюс один будет два, а два плюс два будет четыре, сколько будет четыре плюс четыре?\n'
    '— Это несправедливо, Мариванна! Вы всегда отвечаете на легкие вопросы, а мне достаются самые тяжелые...',
    'Вовочка приходит из школы с запиской от учительницы родителям.\n'
    '— Ваш сын сильно воняет, Вовочку надо мыть.\n'
    'Отец отписал ответ:\n'
    '— Вовочку не надо нюхать, Вовочку надо учить.',
    '— Что означает, когда инспектор ГАИ поднимает вверх на вытянутой руке жезл?\n'
    '— Свободная касса!',
    'Автоинспектор, уставший, в конце рабочего дня тормозит машину:\n'
    '— Так, предъявите ваши деньги, пожалуйста...',
    'Едет машина с пассажирами. Вдруг водитель говорит всем:\n'
    '— Пристегните ремни, за тем поворотом гаишник любит стоять.\n'
    'И точно, за поворотом их сразу палочкой к обочине. Гаишник заглядывает и с отвращением говорит:\n'
    '— За десять тысяч удавиться уже готовы!',
    'На международных соревнованиях «лежащих полицейских» победили, конечно, наши.\n '
    'В отличие от американских наши залегли не тупо на дороге, а за кустами.',
    'Дочь обращается к отцу, который смотрит футбол.\n'
    '— Папа, выключи на минутку телевизор, мне надо с тобой поговорить.\n'
    '— Я уберу звук, говори.\n'
    '— Никак не могу решить, на какой факультет мединститута мне лучше поступить, на кардиологический, '
    'или на стоматологический. \n'
    '— А сколько у человека зубов?\n'
    '— Тридцать два.\n'
    '— А сердце одно?\n'
    '— Одно.\n'
    '— Счёт 32:1 в пользу стоматологического.',
    'Вчера зашел в магазин «Все для футбола». Купил там пиво, сигареты и телевизор.',
    'Для вас, футбольные фанаты! Поступило в продажу новое мыло «Судья»! Мы используем только натуральные компоненты!',
    'Сидит Абрам в пивном ларьке, на улице минус тридцать, и рассуждает: \n'
    'Ну и хитрожопые эти русские. Позанимали теплые места у мартеновских печей.',
    'Одному арабскому нефтяному шейху срочно понадобилось переливание крови. У шейха группа крови очень редкая'
    ' и нашли ее только у одного еврея. Тот согласился, сделали переливание, за что араб подарил еврею дом и машину. \n'
    'Через год та же история — срочно нужна кровь.\n '
    'Еврей с радостью бежит в пункт по переливанию крови, за что арабский шейх дарит еврею коробку печенья.\n '
    'Еврей, удивленно:\n'
    '— Но прошлый раз вы подарили мне дом и машину!\n'
    'Араб:\n'
    '— А в тот раз во мне еще не текла еврейская кровь.\n',
    '— Чем отличается англичанин от еврея?\n'
    '— Англичанин уходит и не прощается, а еврей прощается и не уходит.',
    'Мент ловит наркомана в зоопарке:\n'
    '- Кололся?\n'
    '- Нет.\n'
    '- Проверим...\n'
    '- Кто там в клетке сидит? Показывает мент на кенгуру. Наркоман тупо смотрит на животное:\n'
    '- Заяц. Лет 40-45.' ]

best_jokes = [
    'Парень приводит девушку домой, знакомиться. Та заходит в коридор, наклоняется туфли снять и громко пердит, '
    'смущается и смотря в потолок говорит:\n'
    '- ой, какая у Вас люстра красивая...\n'
    'Ей парень отвечает:\n'
    '- в зал зайдешь вообще обосрёшься!\n',
    'Толстые стриптизерши иногда перегибают палку.',
    '"Это же бесчеловечно!" — кричали людоеды, читая вегетарианское меню',
    'Приходит негритянка к гинекологу, '
    'сидит в кресле, гиниколог так задумчиво смотрит туда... \n'
    'потом говорит...\n'
    '- Все! решено! Беру черный Porsche Cayenne с красным кожаным салоном.\n',
    'Сын, 3 года, впервые попал в баню с отцом:\n'
    '- Папа,какая у тебя писька большая!\n'
    '- Твои бы слова да маме в рот!',
    'Еду в автобусе. Пробка. Водитель объявляет:\n'
    '- Следующая остановка "Пятого декабря".\n'
    'Кто-то из салона:\n'
    '- Ни хуя себе пробка!\n',
    '-Молодой человек, в банк голым нельзя!\n'
    '-Да я только за кредит заплатить...',
    '– Мужчина! У Вас к жопе газета прилипла!\n'
    '– Что, правда?\n'
    '– Нет, блядь, Известия!',
    '— Папа, знакомься, это Александр.\n'
    '— Проходите Александр, отобедайте с нами.\n'
    '— Папа, Александр сыт!\n'
    '— Александр, не ссыте, проходите!',
    '- Выйдешь за меня?\n'
    '- Конечно, дорогой! Я так долго ждала этого!\n'
    '- Тогда завтра к 8.00. Спецовка у Михалыча в каптёрке.',
    'Когда Буратино сломал ногу, папа Карло смастерил ему вместо ноги колесо. И пошло-поехало...',
    'Почему у тебя ботинки в помаде? Опять по бабам ходил?',
    'Приходит мужик к урологу:\n'
    '- Доктор, что мне делать? У меня хуй постоянно чешется!\n'
    '- Мой чаще...\n'
    '- Нет! Мой!',
    'Приходит мужик в зоомагазин и думает : Хочу попугая.\n'
    'Ему предложили попугая за 1000 $ \n'
    'Мужик спросил: Почему цена такая?\n'
    'А продавец отвечает: Они говорить умеют, но у него нет лап.\n'
    'Мужик подходит к птице говорит: Ты реально говорить умеешь?\n'
    'Попугай отвечает : ДА\n'
    'Мужик в шоке , купил его и он оказался хорошим собеседником с тонким чувством юмора\n'
    'Мужик спросил : А как ты на жердочке висишь?\n'
    'Попугай говорит : А я писькой обматываю и в жопу пихаю так и держусь.\n'
    'Мужик этому не сильно удивился.\n'
    'Однажды он пришел весь в попыхах и спрашивает Попугая:\n'
    'Что здесь случилось?\n'
    'Попугай говорит: Сначала к твоей жене пришел в дом курьер и они начали раздеваться и целоваться\n'
    'Мужик спросил: А дальше что?\n'
    'Попугай сказал: А у меня хуй встал и я упал',
    'Дети работают лучше полиции, ведь педофилов они находят гораздо быстрее',
    'Купил чукча машину и уехал в город, через неделю звонит и говорит, что приехал.\n '
    'Родственники ждут его обратно неделю, две, три. На четвертую неделю приезжает. Его спрашивают:\n'
    '- Почему так долго?\n'
    '- Да потому что вперёд 4 скорости, а назад одна!',
    '— Продайте мне собаку'
    '— Суку?\n'
    '— Не, суку не надо, давайте нормальную\n'
    '— Сука это пол собаки\n'
    '— Да нахуя мне пол собаки? Давайте целую',
    '— Итак, нам нужно придумать название для нашего гей-порно на тему инцеста. Есть идеи?\n'
    '— "Весь в отца"',
    'Вместо привычного голубя в окно залетел попугай\n'
    '\n'
    '"Голосовуха" - подумал Штирлиц',
    '- А я вчера мимо цирка проходил, меня клоуны выебали...\n'
    '- Серьёзно?\n'
    '- Нет, блин, с шуточками.',
    '- Доктор, у меня в голове музыка играет\n'
    '- И что?\n'
    '- Я такую не слушаю',
    '- Микола, бач, шо це за машина?\n'
    '- Цементовоз!\n'
    '- Як цементовоз? Там же люди!\n'
    '- Да це менти!',
    'прием у окулиста:\n'
    '- какая это буква?\n'
    '- БЛЯТЬ, КТО ЗДЕСЬ?',
    'Заходит мотоциклист в магазин и говорит:\n'
    '- Отрежте 100гр колбасы сзади и 100гр спереди\n'
    'Продавщица спрашивает:\n'
    '- А вы случайно не мотоциклист?\n'
    '- Как вы узнали?\n'
    '- В начале анекдота было написано',
    'Что общего между оргазмом и пульсом?\n'
    '\n'
    '\n'
    'Неважно был ли он у неё',
    'Албанскими учёными изобретён радар, безошибочно определяющий чужие самолёты. \n'
    'Принцип действия радара прост: все самолёты, появляющиеся на экране — чужие. Своих самолётов в Албании нет.',
    'У кого нет ног, но все равно может ходить? У армянина инвалида',
    'Идет Мент по улице и видит, как маленькая Девочка в песочнице что-то лепит.\n'
    '- Девочка, а что ты лепишь?\n'
    '- мента\n'
    '- А из чего?\n'
    '- Глина, песок, говно.\n'
    'Мент разозлился:\n'
    '- А ну, щас же сломай, а то к родителям отведу!\n'
    'Через некоторое время мент опять подходит.\n'
    '- Hу, а сейчас что лепишь?\n'
    '- Пожарника.\n'
    '- Из чего?\n'
    '- Глина, песок.\n'
    'Мент (ухмыляясь):\n'
    '- А почему без говна?\n'
    'Девочка:\n'
    '- А если говно добавить, опять мент получится...',
    'Как зовут узбека-металлурга? '
    '\n'
    'Никельбек',
    'Дети во дворе спорили, чей папа сильнее, даже не подозревая, что это один и тот же человек.']
